tutorials/Free_Flow_Cases/Bretherton/porous_Boundary/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 1
    volScalarFieldValue eps 1
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.02e-3 0.1e-3 1);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 0
        );
    }

    boxToCell
    {
        box (0 -1 0) (1 0 1);
        fieldValues
        (
            volScalarFieldValue eps 0.001
        );
    }

    boxToCell
    {
        box (0 0.1e-3 0) (1 1 1);
        fieldValues
        (
            volScalarFieldValue eps 0.001
        );
    }

);


// ************************************************************************* //
